#ifndef RANDOM
#define RANDOM

////////////////////////////////////////////////////////////////
//クラス名　　　　： Random
//作成者　　　　　： 沙田　峻
//概要　　　　　　： 乱数を取得するクラス
//使用したサイト　：http://siv3d.hateblo.jp/entry/2013/02/17/231829
//更新　　　　　　：
//H28/12/9/　クラスの作成
//H28/12/11/　RandomValue()関数を作成
//H28/12/11/　RandomRange()関数を作成
///////////////////////////////////////////////////////////////
#include<Random>

namespace variableNS {

	//ランダムクラス
	class Random {

		
	   public:	   

		  //////////////////////////////////////// 
		  //0.0 ～1.0　間の数値の乱数を取得
		  //戻り値     :0.0から0.9間の乱数の数値
		  ///////////////////////////////////////
		  static float Value();   


		  //////////////////////////////////////// 
		  //min ～　max 間の整数の乱数を取得
		  //min　　　　: 取りたい整数の最小値
		  //max　　　　: とりたい整数の最大値
		  //戻り値　　 : min ～max 間の乱数の整数
		  ///////////////////////////////////////
	      static int   Range(int min, int max);   


		  //////////////////////////////////////// 
		  //min ～　max 間の整数の乱数を取得
		  //min 　　　 : 取りたい整数の最小値
		  //max 　　　 : とりたい整数の最大値
		  //戻り値　　 : min～max 間の乱数の数値
		  ///////////////////////////////////////
		  static float Range(float min, float max); 

	};
}

#endif

